############################################################################# 
# IAM
#############################################################################

# 変数名: github_org
# 説明: GitHubの組織名もしくはアカウント名
# 型の形式: string
# その他追記事項:
# ・必要なければsensitiveを外す

variable "github_org" {
  sensitive = true
  type      = string
}

# 変数名: github_repository
# 説明: 認可を要求するリポジトリ
# 型の形式: string
# その他追記事項:
# ・必要なければsensitiveを外す

variable "github_repository" {
  sensitive = true
  type      = string
  default   = "*"
}

#############################################################################
# S3
#############################################################################

# 変数名: s3_bucket_name
# 説明: HTMLファイルを格納するバケット名
# 形式: string
# その他追記事項:
# ・3 ~ 63文字
# ・小文字・大文字・数字・ピリオド・ハイフン

variable "s3_bucket_name" {
  type = string
}

#############################################################################
# Route53
#############################################################################

# 変数名: website_domain
# 説明: サイトのドメイン名
# 形式: string 例)example.com
# その他追記事項: サブドメインは伴わない

variable "website_domain" {
  type = string
}

#############################################################################
# CloudFront
#############################################################################

# 変数名: allow_locations
# 説明: サイトにアクセスできる国のリスト
# 形式: list(string) 例) ["JP"]
# その他追記事項: 
# ・カンマで区切る

variable "allow_locations" {
  type    = list(string)
  default = ["JP"]
}

############################################################################# 
# その他
#############################################################################

# 変数名: default_tags
# 説明: 共通するタグキーのMap
# 形式: map(string)
# その他追記事項:

variable "default_tags" {
  type = map(string)
  default = {
    "Environment" = "Production"
    "Author"      = "Mitate Gengaku"
    "Owner"       = "Mitate Gengaku"
    "Project"     = "S3 Static Site"
    "Version"     = "1.0"
  }
}
